#მომხმარებელს შემოაყვანინეთ რიცხვი და შეამოწმეთ დადებითია თუ უარყოფითი.
#)მომხარებელს შემოაყვანინეთ ასაკი და შეამოწმეთ სრულწლოვანი არის თუ არა .

#)მომხმარებლს შემოაყვანინეთ რიცხვი და თუ 10 ზე მეტია შედეგად გაამრავლეთ 2 ზე.
# 1) დადებითი თუ უარყოფითი
num = int(input("შეიყვანე რიცხვი: "))

if num > 0:


    print("რიცხვი უარყოფითია")
else:
    print("რიცხვი არის 0")

# 2) ასაკი - სრულწლოვანი თუ არა
age = int(input("შეიყვანე ასაკი: "))

if age >= 18:
    print("სრულწლოვანი ხარ")
else:
    print("არ ხარ სრულწლოვანი")

# 3) რიცხვი - თუ 10-ზე მეტია, გაამრავლე 2-ზე
num2 = int(input("შეიყვანე რიცხვი: "))

if num2 > 10:
    result = num2 * 2
    print("შედეგი:", result)
else:
    print("რიცხვი 10-ზე მეტი არ არის")