# 1) კომენტარების სახით დეტალურად ახსენით while loop - ი (რა არის, როგორ იწერება, რისთვის გამოიყენება დ ა.შ)
#  #while loop არის ციკლი რომელიც მანამ მუშაობს სანამ კოდი არ გახდება  true
# 2) მომხმარებელს შემოატანინეთ რიცხვი, შემდგომ while loop - ის დახმარებით გამოიტანეთ რიცხვები 1 - იდან მომხმარებლის რიცხვის ჩათვლით.
num = int(input("შეიყვანეთ რიცხვი: "))
count = 1
while count <= num:
    print(count)
    count += 1
# 3) მომხმარებელს შემოატანინეთ რიცხვი და while loop - ის გამოყენებით გამოიტანეთ რიცხვები (1 - იდან მომხმარებლის რიცხვის ჩათვლით) შემდეგი სახით:
num  = int(input("enter ur number"))
i=1
while i <= num:
 if i % 2 ==0:
  print(i)
 else:
  print(i)
  i+=1
# 1 this number is odd.
# 2 this number is even.
# 3 this number is odd.

# ანუ უნდა შეამოწმოთ რიცხვი ლუწია თუ კენტი.
# 4) დეტალურად ახსენით რიცხთვის გამოიყენება thead, tbody და tfoot თეგები.
   #thead თეგით ვწერთ სათაურს ცხრილში
   #tbody ვწერთ ცხრილში მთავარ მონაცემს
   #tfoot გამოიყენება ცხრილის ქვედა ნაწილისთვის
