# მომხმარებელს ვთხოვთ ასაკისა და გულისცემის შეყვანას
age = int(input("შემოიყვანეთ თქვენი ასაკი: "))
heart_rate = int(input("შემოიყვანეთ თქვენი გულისცემა (BPM): "))

# 1. პირობა: ასაკი ნაკლებია 30-ზე და გულისცემა ნაკლებია 140-ზე
if age < 30 and heart_rate < 140:
    print("შეგიძლიათ მეტი ივარჯიშოთ")

# 2. პირობა: ასაკი მეტია ან ტოლია 30-ზე და გულისცემა მეტია 170-ზე
elif age >= 30 and heart_rate > 170:
    print("დასვენება გჭირდებათ")

# 3. ყველა სხვა შემთხვევაში
else:
    print("აქტივობის დონე ნორმალურია")
    

